// countries.js

const countryDict = {
    "392": { zh: "日本", flag: "🇯🇵" },
    "410": { zh: "韓國", flag: "🇰🇷" },
    "158": { zh: "台灣", flag: "🇹🇼" },
    "840": { zh: "美國", flag: "🇺🇸" },
    "826": { zh: "英國", flag: "🇬🇧" },
    "036": { zh: "澳洲", flag: "🇦🇺" },
    "250": { zh: "法國", flag: "🇫🇷" },
    "276": { zh: "德國", flag: "🇩🇪" },
    "380": { zh: "義大利", flag: "🇮🇹" },
    "724": { zh: "西班牙", flag: "🇪🇸" },
    "124": { zh: "加拿大", flag: "🇨🇦" },
    "076": { zh: "巴西", flag: "🇧🇷" },
    "702": { zh: "新加坡", flag: "🇸🇬" },
    "764": { zh: "泰國", flag: "🇹🇭" },
    "704": { zh: "越南", flag: "🇻🇳" },
    "360": { zh: "印尼", flag: "🇮🇩" },
    "156": { zh: "中國", flag: "🇨🇳" },
    "356": { zh: "印度", flag: "🇮🇳" },
    "608": { zh: "菲律賓", flag: "🇵🇭" },
    "458": { zh: "馬來西亞", flag: "🇲🇾" },
    "484": { zh: "墨西哥", flag: "🇲🇽" },
    "032": { zh: "阿根廷", flag: "🇦🇷" },
    "710": { zh: "南非", flag: "🇿🇦" }
};